Repository: lengycihao/order_app
Catalog: lib/l10n/app_*.arb
Languages: it, zh

# appTitle
source: OUHUA RISTOO(Waiter)
it: OUHUA RISTOO(Cameriere)
zh: 欧华餐饮系统(服务员)

# pleaseEnterLoginName
source: Please enter your login name
it: Inserisci un nome di accesso
zh: 请输入登录名

# pleaseEnterPassword
source: Please enter the password
it: Per favore inserisci la password
zh: 请输入密码

source: Login
it: Accedi
zh: 登录

# copyright
source: Â©2025 Ouhua Zhichuang (Hangzhou) Technology Co., Ltd.
it: ©2025 Ouhua Zhichuang (Hangzhou) Technology Co., Ltd.
zh: ©2025 欧华智创（杭州）科技有限公司

# loginNameCannotBeEmpty
source: Account cannot be empty
it: Il nome di accesso non può essere vuoto
zh: 登录名不能为空

source: Password cannot be empty.
it: La password non può essere vuota.
zh: 密码不能为空

source: Incorrect Password
it: Password errata
zh: 用户名或密码错误

source: Login Successful
it: Accesso effettuato con successo
zh: 登录成功

source: Login failed, please retry
it: Accesso fallito, riprova per favore
zh: 登录失败，请重试

# accountLoggedInOnAnotherDevice
source: The account has been logged in on another device
it: L'account è stato accesso su un altro dispositivo
zh: 账号已在其他设备登录

source: Table
it: Tavolo
zh: 桌子

source: More
it: Di più
zh: 更多

source: Merge Tables
it: Tavolo Fusione
zh: 并桌

source: Clear Table
it: Svuota Tavolo
zh: 撤桌

source: Close Table
it: Chiudi Tavolo
zh: 关桌

source: Confirm
it: Conferma
zh: 确认

source: Including Tables
it: Includendo i Tavoli
zh: 包含桌台

source: Select Table
it: Seleziona Tavolo
zh: 选择桌子

source: Reason
it: Motivo
zh: 原因

source: Cancel
it: Annulla
zh: 取消

source: Table People
it: Tabelle Persone
zh: 本桌人数

source: Adults
it: Adulti
zh: 大人

source: Children
it: Bambini
zh: 小孩

source: Select Menu
it: Seleziona il Menù
zh: 选择菜单

source: Start Ordering
it: Inizia l'ordinazione
zh: 开始点餐

# currentTableUnavailable
source: The current table is unavailable
it: Il tavolo corrente non è disponibile.
zh: 当前桌台不可用

# onlyOneNonFreeTableCanBeSelected
source: Only one of the following non - free tables can be selected.
it: Può essere selezionato solo uno dei seguenti tavoli non liberi.
zh: 仅可选择一张以下非空闲状态桌子

# pleaseSelectNumberOfDiners
source: Please select the number of diners
it: Seleziona il numero di commensali
zh: 请选择就餐人数

# standardAdultsForThisTable
source: Standard number of adults for this table:
it: Numero standard di adulti per questo tavolo:
zh: 本桌标准大人人数:

# standardChildrenForThisTable
source: Standard number of children for this table:
it: Numero standard di bambini per questo tavolo:
zh: 本桌标准小孩人数:

# pleaseSelectMenu
source: Please select a menu
it: Seleziona un menù
zh: 请选择菜单

source: Merge successful
it: Fusione avvenuta con successo
zh: 合并成功

source: Merge failed, please retry.
it: Fusione fallita, riprova per favore.
zh: 合并失败，请重试

# oneTableMustRemainWhenRemoving
source: When removing tables, one table must remain.
it: Quando si rimuovono i tavoli, deve rimanere un tavolo.
zh: 撤桌必须留下一张桌子

source: Table removal successful
it: Rimozione del tavolo avvenuta con successo
zh: 撤桌成功

source: Table removal failed, please retry
it: Rimozione del tavolo fallita, riprova per favore
zh: 撤桌失败，请重试

source: Table closing successful
it: Chiusura del tavolo avvenuta con successo
zh: 关桌成功

source: Table closing failed, please retry
it: Chiusura del tavolo fallita, riprova per favore
zh: 关桌失败，请重试

source: Table opening successful
it: Apertura del tavolo avvenuta con successo
zh: 开桌成功

source: Table opening failed, please retry
it: Apertura del tavolo fallita, riprova per favore
zh: 开桌失败，请重试

# pleaseEnterLast4DigitsOfReservedPhone
source: Please enter the last 4 digits of the reserved phone number?
it: Inserisci gli ultimi 4 cifri del numero di cellulare prenotato?
zh: 请输入预留手机号码后 4 位？

# numberIncorrectPleaseReenter
source: The number is incorrect, please re-enter
it: Il numero non è corretto, reinserisci per favore
zh: 号码不正确，请重新输入

# numberCorrectEnjoyYourMeal
source: The number is correct. Enjoy your meal!
it: Il numero è corretto. Buon appetito!
zh: 号码正确，祝你用餐愉快

source: Menu
it: Menù
zh: 菜单

source: Ordered
it: Ordinato
zh: 已点

source: Enter dish code or name
it: Inserisci codice o nome del piatto
zh: 输入菜品编码或名称

# selectSpecification
source: Variante
zh: 选规格

# placeOrder
source: Order
it: Ordina
zh: 下单

source: Clear
it: Pulisci
zh: 清空

source: Allergens
it: Allergeni
zh: 敏感物

# excludeDishesWithAllergens
source: Exclude dishes containing the specified allergens
it: Escludi i piatti contenenti gli allergeni specificati
zh: 去除含有指定敏感物的菜品

source: Selected:
it: Selezionato:
zh: 已选：

source: Cart
it: Carrello
zh: 购物车

source: Change Table
it: Cambia Tavolo
zh: 更换桌子

source: Change Menu
it: Cambia Menù
zh: 更换菜单

source: Increase Number of People
it: Aumenta il Numero di Persone
zh: 增加人数

source: No relevant dishes found
it: Non sono stati trovati piatti correlati
zh: 未找到相关菜品

# dishSoldOutPleaseChooseAnother
source: is sold out. Please choose another dish.
it: è esaurito. Si prega di scegliere un altro piatto.
zh: 已售罄，请选择其他菜品

source: Next round time not reached
it: Tempo del prossimo turno non raggiunto
zh: 下一轮次时间未到

source: Cart has new changes
it: Carrello ha nuovi cambiamenti
zh: 购物车有新的变动

source: Order placed successfully
it: Ordine inviato con successo
zh: 下单成功

# orderPlacementFailedContactWaiter
source: Order Placement Failed, Please Contact the Waiter
it: Ordine non inviato, contatta il cameriere
zh: 下单失败，请联系服务员

source: Clear shopping cart?
it: Vuoi cancellare il
zh: 是否清空购物车？

# quantityExceedsLimitPlaceAtOriginalPrice
source: Quantity exceeds the limit. Place order at original price?
it: La quantità supera il limite. Vuoi ordinare al prezzo originale?
zh: 数量超出限制，是否以原价下单？

source: Takeaway
it: Da Asporto
zh: 外卖

source: Unsettled
it: Non Saldato
zh: 未结帐

source: Settled
it: Saldato
zh: 已结帐

source: Please enter pickup code
it: Inserisci il codice di ritiro
zh: 请输入取餐码

source: Order Information
it: Informazioni dell'Ordine
zh: 订单信息

source: Pickup Code
it: Codice di Ritiro
zh: 取餐码

source: Pickup Time
it: Orario di Ritiro
zh: 取餐时间

source: Remarks
it: Note
zh: 备注

source: Order Source
it: Origine dell'Ordine
zh: 订单来源

source: Order Placement Time
it: Orario di Inserimento Ordine
zh: 下单时间

source: Checkout Time
it: Orario di Pagamento
zh: 结账时间

source: Product Information
it: Informazioni del Prodotto
zh: 商品信息

source: Additional Information
it: Altre Informazioni
zh: 其他信息

source: Other Time
it: Altro Orario
zh: 其他时间

# pleaseSelectPickupTime
source: Please select a pickup time
it: Si prega di selezionare un orario di ritiro
zh: 请选择取餐时间

# pickupTimeMustBeAtLeast30MinutesLater
source: The pickup time must be at least 30 minutes later.
it: L'orario di ritiro deve essere almeno 30 minuti dopo.
zh: 取餐时间至少30分钟后

source: Profile
it: Profilo
zh: 我的

source: Account
zh: 账号

# expirationDate
source: Expiry date
it: Scadenza
zh: 到期日期

source: Remaining Days
it: Giorni Rimanenti
zh: 剩余天数

source: Change Password
it: Cambia Password
zh: 修改密码

source: Language
it: Lingua
zh: 语言

source: System Version
it: Versione del Sistema
zh: 系统版本

source: Update
it: Aggiorna
zh: 更新

source: Logout
it: Disconnetti
zh: 退出登录

source: New Password
it: Nuova Password
zh: 新密码

# anyCharactersOf8OrMore
source: Any characters of 8 or more digits
it: Qualsiasi carattere di 8 o più cifre
zh: 任意8位以上字符

source: Please enter new password
it: Inserisci la nuova password
zh: 请输入新密码

source: Confirm Password
it: Conferma Password
zh: 确认密码

source: Please re-enter new password
it: Inserisci di nuovo la nuova password
zh: 请再次输入新密码

source: Submit
it: Invia
zh: 提交

source: Password updated successfully
it: Password modificata con successo
zh: 密码修改成功

source: Password change failed, please retry.
it: La modifica della password è fallita, riprova per favore.
zh: 密码修改失败，请重试

source: Language switched successfully
it: Lingua cambiata con successo
zh: 切换语言成功

source: Language switch failed, please retry.
it: Il cambio di lingua è fallito, riprova per favore.
zh: 切换语言失败，请重试

source: Network error, please try again
it: Errore di rete, riprova per favore
zh: 网络错误，请重试

# operationTooFrequentPleaseTryAgainLater
source: Operation is too frequent, please try again later.
it: L'operazione è troppo frequente, riprova più tardi.
zh: 操作频繁 请稍后再试

# noData
source: No data available
it: Nessun dato disponibile
zh: 暂无数据

# loadAgain
source: Retry
it: Riprova
zh: 重新加载

# allData
source: All
it: Tutti
zh: 全部

# loadingData
source: Loading...
it: Caricamento...
zh: 加载中...

source: Success
it: Successo
zh: 成功

source: Failed
it: Non riuscito
zh: 失败

source: Select people
it: Seleziona persone
zh: 选择人数

# loadMenuFailed
source: Menu loading failed
it: Caricamento menu fallito
zh: 获取菜单失败

# twoPasswordsDoNotMatch
source: Passwords do not match
it: Le password non corrispondono
zh: 两次输入的密码不一致

# passwordLengthCannotBeLessThan8
source: Minimum 8 characters
it: Minimo 8 caratteri
zh: 密码最少8位字符

source: per portion
it: a porzione
zh: /份

source: Replace
it: Sostituire
zh: 更换

# changePerson
source: Change guests
it: Cambia persone
zh: 更换人数

# getTableFailed
source: Failed to get table
it: Impossibile ottenere il tavolo
zh: 获取桌台失败

# pleaseSelectTable
source: Please select a table
it: Seleziona un tavolo
zh: 请选择桌台

# pleaseExitAndInAdain
source: Please exit the ordering page and re-enter!
it: Esci dalla pagina dell’ordine e rientra!
zh: 请退出点餐页面重新进入!

# noCanUseTable
source: No available tables
it: Nessun tavolo disponibile
zh: 暂无可用桌台

# noCanUseMenu
source: No available menu
it: Nessun menu disponibile
zh: 暂无可用菜单

# pleaseSelectAtLeastOnePerson
source: Please select at least 1 person
it: Seleziona almeno 1 persona
zh: 请至少选择1人

source: Merging...
it: Unione in corso...
zh: 合并中...

source: Unknown
it: Sconosciuto
zh: 未知

# cartIsEmpty
source: The shopping cart is empty
it: Il carrello è vuoto
zh: 购物车是空的

# areYouSureToDeleteTheDish
source: Do you want to delete this dish?
it: Vuoi eliminare questo piatto?
zh: 是否删除菜品？

source: Delete
it: Elimina
zh: 删除

source: Quantity
it: Quantità
zh: 数量

source: Please select
it: Seleziona
zh: 请选择

# filterDishesWithAllergens
source: Filter dishes containing allergens
it: Filtra i piatti contenenti allergeni
zh: 请选择

# noOrder
source: No order data available
it: Nessun dato sugli ordini disponibile
zh: 暂无订单

source: Go to order
it: Vai a ordinare
zh: 去点餐

source: Unpaid
it: Non pagato
zh: 未结账

source: Paid
it: Pagato
zh: 已结账

# orderNo
source: Order Number
it: Numero d'ordine
zh: 订单编号

# orderSourceNew
source: Source of Document
it: Fonte del documento
zh: 单据来源

source: Product Details
it: Dettagli del prodotto
zh: 商品详情

# operationConfirmed
source: Confirm Action
it: Conferma operazione
zh: 操作确认

# areYouSureToLogout
source: Do you want to log out?
it: Vuoi disconnetterti?
zh: 是否退出当前登录？

# sureLogout
source: Confirm Logout
it: Conferma disconnessione
zh: 确认退出

source: Welcome
it: Benvenuto
zh: 欢迎使用

# serviceApp
source: Server
zh: 服务端

source: Password
zh: 密码

source: Remark
it: Nota
zh: 备注

source: Add Remark
it: Aggiungi Nota
zh: 添加备注

source: Edit Remark
it: Modifica Nota
zh: 修改备注

source: Confirm order?
it: Confermare l'ordine?
zh: 确认下单？

source: Please enter
it: Per favore inserisci
zh: 请输入

# logining
source: Logging in...
it: Accesso in corso...
